[
       {
             "title" : "Application to Society",
             "id" : "sa",
             "elements" : [
                {
                        "title" : "Cloud Computing", 
                        "description" : "Cloud Computing", 
                        "id": "cc"
                },
                { 
                        "title" : "Digital Transformation", 
                        "description" : "Digital Transformation", 
                        "id": "dt"
                },
                {
                        "title" : "Reliable Computing", 
                        "description" : "Reliable Computing", 
                        "id": "rc"
                }
        ]
     },
     {
             "title" : "Research Areas",
             "id" : "ra",
                   "elements" : [
                { 
                        "title" : "Applied Logic",
                        "description" : "Traditionally the science that studies reasoning, logic has become an important tool in several areas of Computer Science. In our group, we apply logic and logic techniques to specify and verify properties of programming models, be it in the form of particular logics that we can use to write and prove interesting properties; as type systems that automatically ensure interesting properties of our systems; or through correspondences between logic proofs and programs that allow us to view the latter in insightful new ways. We also use logic and state-of-the-art solvers to optimize real world problems such as scheduling, packing, timetabling, configuration, and logistics problems.",
                        "id": "al"
                },
                { 
                        "title" : "Concurrency Theory", 
                        "description" : "Concurrency Theory", 
                        "id": "ct"
                },
                { 
                        "title" : "Programming Languages", 
                        "description" : "Programming Languages", 
                        "id": "pl"
                },
                { 
                        "title" : "Software Engineering", 
                        "description" : "Software Engineering is the establishment and use of sound engineering principles in order to economically obtain software that is reliable and works efficiently on real machines. Software engineering is needed due to the hight rate of change in user requirements and environment on which the software is working. Based on the application to develop, the available resources and constraints, Software Engineering provides best practices and methodologies to ease and guide the task of developing and maintaining the software from the initial requirement specification through its entire evolution.", 
                        "id": "se"
                }
        ]
     },
     {
             "title" : "Research Topics",
             "id" : "rt",
                   "elements" : [
                { 
                        "title" : "Choreographic Programming", 
                        "description" : "Choreographic Programming is an emerging paradigm for correct-by-construction concurrent programming based on message passing. In this paradigm, communications are specified using an Alice-to-Bob notation, rather than as two separate send and receive actions. As a consequence, protocols are guaranteed not to deadlock because of communication mismatches. Models based on choreographic programming have been successfully developed for different settings where concurrent programming is challenging, including service-oriented computing and cyber-physical systems.<br />In our group, we are extending choreographic programming by developing more expressive and powerful languages that can be used in real-world applications. The main challenge is to increase expressitivy while maintaining the good theoretical properties that made choreography languages successful in the first place.",
                        "id": "cp"
                },
                { 
                        "title" : "Data Consistency",
                        "description" : "The increasing dependency on computers to perform everyday tasks is associated with the need to store larger and larger quantities of information, which must be efficiently processed and retrieved. One of the challenges involved in managing this data is ensuring its internal consistency, especially as the information being stored changes due to the evolution of the real-world data it models.<br />Modern-day database management systems address this problem by allowing the user to define integrity constraints &ndash; properties of the data that should hold at all times &ndash; and algorithms to repair the database when these properties no longer hold. Extending these techniques to more powerful reasoning tools, such as those used in the Semantic Web, is however an ongoing complex process, which we address in our research.",
                        "id": "dc"
                },
                { 
                        "title" : "DevOps", 
                        "description" : "DevOps is a software engineering collections of practices to link the software development (Dev) with software operation (Ops). DevOps strongly advocates for automation and monitoring at all steps of software construction, from integration, testing, releasing to deployment and infrastructure management. By using DevOps methodology it is possible to reduce the time between committing a change to a system and the change being placed into normal production, while ensuring high quality.", 
                        "id": "do"
                },
                { 
                        "title" : "Microservices", 
                        "description" : "Microservices", 
                        "id": "ms"
                },
                { 
                        "title" : "Quantitative Models", 
                        "description" : "Quantitative Models", 
                        "id": "qm"
                },
                { 
                        "title" : "Theorem Proving",
                        "description" : "Since researchers in 1973 proved a mathematical result (the four-color theorem) using a computer program, there has been an increasing interest in using computers to do abstract mathematics &ndash; rather than simply viewing them as extremely powerful calculators. Although the classical results of Gödel and Turing tell us that there are limits to how much can be automated, computers have gained notourious success at being able to prove safety and correctness properties of sensitive software &ndash; either on their own or interactively.<br />Building upon our group's expertise on theorem proving, we plan to start applying it to choreographic programming, evolving our mathematical constructions into full-fledged certified compilers that are guaranteed not to introduce errors in the code they generate.",
                        "id": "tp"
                }
        ]
     }
]
