[
	{
		"bibitem" : "@inproceedings{DBLP:conf/sefm/LaneseGMZ08,  author = {Ivan Lanese and  Claudio Guidi and  Fabrizio Montesi and  Gianluigi Zavattaro},  title = {Bridging the Gap between Interaction- and Process-Oriented Choreographies},  booktitle = {{SEFM}},  pages = {323--332},  publisher = {{IEEE} Computer Society},  year = {2008} }",
		"links" : [
			{ "link" : "http://fabriziomontesi.com/files/mglz08.pdf" }
		],
		"abstract" : "Dynamic fault handling is a new approach for dealing with fault management in service-oriented applications. Fault handlers, termination handlers and compensation handlers are installed at execution time instead of being statically defined. In this paper we present this programming style and our implementation of dynamic fault handling in JOLIE, providing finally a nontrivial example of its usage.",
		"tags" : [ "Jolie", "Microservices" ],
		"authors" : [ "Fabrizio Montesi" ],
		"non_group": true,
		"type" : "Conference"
	},
	{
		"bibitem" : "@inproceedings{DBLP:conf/sefm/LaneseGMZ08,  author = {Ivan Lanese and  Claudio Guidi and  Fabrizio Montesi and  Gianluigi Zavattaro},  title = {Bridging the Gap between Interaction- and Process-Oriented Choreographies},  booktitle = {{SEFM}},  pages = {323--332},  publisher = {{IEEE} Computer Society},  year = {2008} }",
		"links" : [
			{ "link" : "http://fabriziomontesi.com/files/lgmz08.pdf" }
		],
		"abstract" : "In service oriented computing, choreography languages are used to specify multi-party service compositions. Two main approaches have been followed: the interaction-oriented approach of WS-CDL and the process-oriented approach of BPEL4Chor. We investigate the relationship between them.In particular, we consider several interpretations for interaction-oriented choreographies spanning from synchronous to asynchronous communication. Under each of these interpretations we characterize the class of interaction-oriented choreographies which have a process-oriented counterpart, and we formalize the notion of equivalence between the initial interaction-oriented choreography and the corresponding process-oriented one.",
		"tags" : [ "Choreographic Programming", "Process Calculi" ],
		"authors" : [ "Fabrizio Montesi" ],
		"non_group": true,
		"type" : "Conference"
	},
	{
		"bibitem" : "@inproceedings{DBLP:conf/acsd/GuidiLMZ08,  author = {Claudio Guidi and  Ivan Lanese and  Fabrizio Montesi and  Gianluigi Zavattaro},  title = {On the interplay between fault handling and request-response service  invocations},  booktitle = {{ACSD}},  pages = {190--198},  publisher = {{IEEE}},  year = {2008} }",
		"links" : [
			{ "link" : "http://fabriziomontesi.com/files/glmz08.pdf" }
		],
		"abstract" : "Service Oriented Computing (SOC) allows for the composition of services which communicate using unidirectional notification or bidirectional request-response primitives. Most service orchestration languages proposed so far provide also primitives to handle faults and compensations. The interplay between fault handling and request-response invocations is nontrivial since, for instance, faults should be notified to the requestresponse communication partners in order to compensate also the remote activities. Our work is motivated by the difficulties encountered in programming, using current orchestration languages, some fault handling strategies. We propose as a solution an orchestration programming style in which fault and compensation handlers are dynamically installed. We show the adequacy of our proposal defining its semantics, and proving that it satisfies some expected high-level properties. Finally, we also show how to apply dynamic handler installation in a nontrivial automotive scenario.",
		"tags" : [ "Jolie", "Microservices", "Process Calculi" ],
		"authors" : [ "Fabrizio Montesi" ],
		"non_group": true,
		"type" : "Conference"
	},
	{
    "bibitem": "@article{CSS08, author = {Cruz-Filipe, Lu{\\'i}s and Sernadas, Am{\\'\\i}lcar and Sernadas, Cristina}, journal = {Logic Journal of the IGPL}, month = {apr}, doi = {10.1093/jigpal/jzm057}, number = {2}, pages = {121--153}, publisher = {Oxford University Press}, title = {Heterogeneous Fibring of Deductive Systems via Abstract Proof Systems}, volume = {16}, year = {2008}}",
    "links": [{
      "link": "http://tinyurl.com/lcfilipe/pubs/paper07.pdf"
    }],
    "tags": ["Logic"],
    "authors": ["Luís Cruz-Filipe"],
    "abstract": "Homogeneous fibring is a meta-logical constructor that produces new logics by combining logics presented in the same way (e.g. both of them endowed with an Hilbert calculus). Heterogeneous fibring (e.g. one of the logics is presented by an Hilbert calculus and the other by a sequent calculus) is an open problem that we solve now. We start by considering consequence systems as providing a solution (a good one when fibring a logic presented by semantic means and another one presented in a deductive way). However consequence systems are not good when we want to obtain as the result of fibring two deductive systems still a deductive system (where a notion of derivation appears in the fibring). The solution is to introduce the concept of (abstract) proof system. The fibring of proof systems is still a proof system and so we have that a derivation in the fibring is obtained from the derivations of the component. Some preservation results are discussed like compactness and semi-decidability.",
    "non_group": true,
    "type": "journal"
  },
  {
    "bibitem": "@article{CFSS08, author = {Cruz-Filipe, Lu{\\'i}s and Rasga, Jo{\\~a}o and Sernadas, Am{\\'\\i}lcar and Sernadas, Cristina}, journal = {Journal of Logic and Computation}, month = {apr}, doi = {10.1093/logcom/exn014}, number = {6}, pages = {885--911}, publisher = {Oxford University Press}, title = {Complete Axiomatization of Discrete-Measure Almost-Everywhere Quantification}, volume = {18}, year = {2008}}",
    "links": [{
      "link": "http://tinyurl.com/lcfilipe/pubs/paper08.pdf"
    }],
    "tags": ["Logic"],
    "authors": ["Luís Cruz-Filipe"],
    "abstract": "Following recent developments in the topic of generalized quantifiers, and also having in mind applications in the areas of security and artificial intelligence, a conservative enrichment of (two-sorted) first-order logic with almost-everywhere quantification is proposed. The completeness of the axiomatization against the measure-theoretic semantics is carried out using a variant of the Lindenbaum&ndash;Henkin technique. The independence of the axioms is analyzed, and the almost-everywhere quantifier is compared with related notions of generalized quantification.",
    "non_group": true,
    "type": "journal"
  },
  {
    "bibitem": "@incollection{CLMRV08, author = {Cruz-Filipe, Lu{\\'i}s and Lanese, Ivan and Martins, Francisco and Ravara, Ant{\\'o}nio and Vasconcelos, Vasco T.}, booktitle = {Proceedings of the 10th IFIP International Conference on Formal Methods for Open Object-based Distributed Systems (FMOODS'08)}, editor = {Barthe, Gilles and de Boer, Frank S.}, month = may, doi = {10.1007/978-3-540-68863-1\\_5}, pages = {59--77}, publisher = {Springer}, series = {LNCS}, title = {Behavioural Theory at Work: Program Transformations in a Service-Centred Calculus}, volume = {5051}, year = {2008}}",
    "links": [{
      "link": "http://tinyurl.com/lcfilipe/pubs/paper09.pdf"
    }],
    "tags": ["Process Calculi"],
    "authors": ["Luís Cruz-Filipe"],
    "abstract": "We analyse the relationship between object-oriented modelling and session-based, service-oriented modelling, starting from a typical UML Sequence Diagram and providing a program transformation into a service-oriented model.  We also provide a similar transformation from session-based specifications into request-response specifications.  All transformations are specified in SSCC &ndash; a process calculus for modelling and analysing service-oriented systems &ndash; and proved correct with respect to a suitable form of behavioural equivalence (full weak bisimilarity).  Since the equivalence is proved to be compositional, results remain valid in arbitrary contexts.",
    "non_group": true,
    "type": "conference"
  }
]
