{ "title" : "2004",
  "papers": [
    {
    "bibitem": "@inproceedings{CW04, author = {Cruz-Filipe, Lu{\\'i}s and Wiedijk, Freek}, booktitle = {Theorem Proving in Higher Order Logics, 17th International Conference, TPHOLs 2004}, editor = {Slind, Konrad and Bunker, Annette and Gopalakrishnan, Ganesh}, month = sep, doi = {10.1007/978-3-540-30142-4\\_5}, pages = {66--81}, publisher = {Springer}, series = {LNCS}, title = {Hierarchical Reflection}, volume = 3223, year = 2004}",
    "links": [{
      "link": "https://imada.sdu.dk/~lcf/pubs/paper03.pdf"
    }],
    "tags": ["Theorem Proving"],
    "authors": ["Luís Cruz-Filipe"],
    "abstract": "The technique of reflection is a way to automate proof construction in type theoretical proof assistants. Reflection is based on the definition of a type of syntactic expressions that gets interpreted in the domain of discourse. By allowing the interpretation function to be partial or even a relation one gets a more general method known as &quot;partial reflection&quot;. In this paper we show how one can take advantage of the partiality of the interpretation to uniformly define a family of tactics for equational reasoning that will work in different algebraic structures. The tactics then follow the hierarchy of those algebraic structures in a natural way.",
    "non_group": true,
    "type": "conference"
  },
  {
    "bibitem": "@inproceedings{CGW04, author ={Cruz-Filipe, Lu{\\'i}s and Geuvers, Herman and Wiedijk, Freek}, booktitle ={Mathematical Knowledge Management, Third International Conference, MKM 2004}, editor ={Asperti, Andrea and Bancerek, Grzegorz and Trybulec, Andrzej}, month = sep, doi ={10.1007/978-3-540-27818-4\\_7}, pages ={88--103}, publisher ={Springer}, series ={LNCS}, title ={C-CoRN: the Constructive Coq Repository at Nijmegen}, volume = 3119, year = 2004}",
    "links": [{
      "link": "https://imada.sdu.dk/~lcf/pubs/paper04.pdf"
    }],
    "tags": ["Theorem Proving"],
    "authors": ["Luís Cruz-Filipe"],
    "abstract": "We present C-CoRN, the Constructive Coq Repository at Nijmegen. It consists of a library of constructive algebra and analysis, formalized in the theorem prover Coq. In this paper we explain the structure, the contents and the use of the library. Moreover we discuss the motivation and the (possible) applications of such a library.",
    "non_group": true,
    "type": "conference"
  }
]
}
