{ "title" : "2020",
  "papers": [
    {
      "bibitem": "@phdthesis{S20, author = {Larisa Safina}, title = {Formal methods and patterns for microservices}, school = {University of Southern Denmark}, year = 2020, month = 1}",
      "tags": [ "Microservices", "Choreographic Programming" ],
      "authors": [ "Larisa Safina" ],
      "abstract": "",
      "non_group" : false,
      "type": "thesis"
    },
    {
      "bibitem": "@incollection{BGMTZ20, author = {Mario Bravetti and  Saverio Giallorenzo and  Jacopo Mauro and  Iacopo Talevi and  Gianluigi Zavattaro},  editor = {Antonio Bucchiarone and  Nicola Dragoni and  Schahram Dustdar and  Patricia Lago and  Manuel Mazzara and  Victor Rivera and  Andrey Sadovykh},  title = {A Formal Approach to Microservice Architecture Deployment},  booktitle = {Microservices, Science and Engineering},  pages = {183--208},  publisher = {Springer},  year = {2020},  url = {https://doi.org/10.1007/978-3-030-31646-4\\_8},  doi = {10.1007/978-3-030-31646-4\\_8} }",
      "tags": [ "Microservices", "Deployment" ],
      "authors": [ "Saverio Giallorenzo", "Jacopo Mauro" ],
      "abstract": "Following previous work on the automated deployment of component-based applications, we present a formal model specifically tailored for reasoning on the deployment of microservice architectures. The first result that we present is a formal proof of decidability of the problem of synthesizing optimal deployment plans for microservice architectures, a problem which was proved to be undecidable for generic component-based applications. Then, given that such proof translates the deployment problem into a constraint satisfaction problem, we present the implementation of a tool that, by exploiting state-of-the-art constraint solvers, can be used to actually synthesize optimal deployment plans. We evaluate the applicability of our tool on a realistic microservice architecture taken from the literature.",
      "non_group" : false,
      "type": "chapter"
    }
  ]
}