{ "title" : "2020",
  "papers": [
    {
	  "bibitem": "@article{CM20, author = {Lu{\\'{\\i}}s Cruz{-}Filipe and  Fabrizio Montesi},  title = {A core model for choreographic programming},  journal = {Theor. Comput. Sci.},  volume = {802},  pages = {38--66},  year = {2020},  url = {https://doi.org/10.1016/j.tcs.2019.07.005},  doi = {10.1016/j.tcs.2019.07.005}}",
	  "links": [
		{ "link" : "https://www.fabriziomontesi.com/files/cm20.pdf" }
	  ],
      "tags": [ "Choreographic Programming", "Process Calculi" ],
      "authors": [ "Luís Cruz-Filipe", "Fabrizio Montesi" ],
	  "abstract": "Choreographic Programming is a paradigm for developing concurrent programs that are deadlock-free by construction, as a result of programming communications declaratively and then synthesising process implementations automatically. Despite strong interest on choreographies, a foundational model that explains which computations can be performed with the hallmark constructs of choreographies is still missing. In this work, we introduce Core Choreographies (CC), a model that includes only the core primitives of choreographic programming. Every computable function can be implemented as a choreography in CC, from which we can synthesise a process implementation where independent computations run in parallel. We discuss the design of CC and argue that it constitutes a canonical model for choreographic programming.",
      "type": "journal",
      "non_group": false
    },
    {
      "bibitem": "@phdthesis{S20, author = {Larisa Safina}, title = {Formal methods and patterns for microservices}, school = {University of Southern Denmark}, year = 2020, month = 1}",
      "tags": [ "Microservices", "Choreographic Programming" ],
      "authors": [ "Larisa Safina" ],
      "abstract": "",
      "non_group" : false,
      "type": "thesis"
    },
    {
      "bibitem": "@incollection{BGMTZ20, author = {Mario Bravetti and  Saverio Giallorenzo and  Jacopo Mauro and  Iacopo Talevi and  Gianluigi Zavattaro},  editor = {Antonio Bucchiarone and  Nicola Dragoni and  Schahram Dustdar and  Patricia Lago and  Manuel Mazzara and  Victor Rivera and  Andrey Sadovykh},  title = {A Formal Approach to Microservice Architecture Deployment},  booktitle = {Microservices, Science and Engineering},  pages = {183--208},  publisher = {Springer},  year = {2020},  url = {https://doi.org/10.1007/978-3-030-31646-4\\_8},  doi = {10.1007/978-3-030-31646-4\\_8} }",
      "tags": [ "Microservices", "Deployment" ],
      "authors": [ "Saverio Giallorenzo", "Jacopo Mauro" ],
      "abstract": "Following previous work on the automated deployment of component-based applications, we present a formal model specifically tailored for reasoning on the deployment of microservice architectures. The first result that we present is a formal proof of decidability of the problem of synthesizing optimal deployment plans for microservice architectures, a problem which was proved to be undecidable for generic component-based applications. Then, given that such proof translates the deployment problem into a constraint satisfaction problem, we present the implementation of a tool that, by exploiting state-of-the-art constraint solvers, can be used to actually synthesize optimal deployment plans. We evaluate the applicability of our tool on a realistic microservice architecture taken from the literature.",
      "non_group" : false,
      "type": "chapter"
    },
    {
      "bibitem": "@inproceedings{AHMNP19, title={{A Graph-Based Tool to Embed the π-Calculus into a Computational DPO Framework}}, author={Jakob Lykke Andersen and Marc Hellmuth and Daniel Merkle and Nikolai N{\\o}jgaard and Marco Peressotti}, booktitle = {Proceedings of the {SOFSEM} 2020 Doctoral Student Research Forum co-located with the 46th International Conference on Current Trends in Theory and Practice of Computer Science {(SOFSEM} 2020), Limassol, Cyprus, January 20-24, 2020}, editor = {Yannis Manolopoulos and George A. Papadopoulos and Theodoros Tzouramanis}, series = {{CEUR} Workshop Proceedings}, volume = {2568}, pages = {121--132}, publisher = {CEUR-WS.org}, year={2020}, url = {http://ceur-ws.org/Vol-2568/paper11.pdf}}",
      "links": [
        { "name" : "technical report",
          "link" : "https://arxiv.org/abs/1911.00407",
          "icon" : "arxiv" },
        { "name" : "tool",
          "link" : "http://cheminf.imada.sdu.dk/epim",
          "icon" : "website" }
      ],
      "tags": [ "Process Calculi", "Rewriting Systems" ],
      "authors": [ "Marco Peressotti" ],
      "abstract": "Graph transformation approaches have been successfully used to analyse and design chemical and biological systems. Here we build on top of a DPO framework, in which molecules are modelled as typed attributed graphs and chemical reactions are modelled as graph transformations. Edges and vertexes can be labelled with first-order terms, which can be used to encode, e.g., steric information of molecules. While targeted to chemical settings, the computational framework is intended to be very generic and applicable to the exploration of arbitrary spaces derived via iterative application of rewrite rules, such as process calculi like Milner's π-calculus. To illustrate the generality of the framework, we introduce EpiM: a tool for computing execution spaces of π-calculus processes. EpiM encodes π-calculus processes as typed attributed graphs and then exploits the existing DPO framework to compute their dynamics in the form of graphs where nodes are π-calculus processes and edges are reduction steps. EpiM takes advantage of the graph-based representation and facilities offered by the framework, like efficient isomorphism checking to prune the space without resorting to explicit structural equivalences. EpiM is available as an online Python-based tool. ",
      "non_group" : true,
      "type": "workshop"
    },    
    {
      "bibitem": "@inproceedings{BMP20, title={{Towards a Formal Model for Composable Container Systems}}, author={Fabio Burco and Marino Miculan and Marco Peressotti}, booktitle = {Proceedings of the 35rd Annual {ACM} Symposium on Applied Computing, {SAC} 2020, Brno, Czech Republic, March 29-April 03, 2020}, pages = {173--175}, publisher = {{ACM}}, year={2020}, url = {https://doi.org/10.1145/3341105.3374121}, doi = {10.1145/3341105.3374121}}",
      "links": [
        { "name" : "technical report",
          "link" : "https://arxiv.org/abs/1912.01107",
          "icon" : "arxiv" }
      ],
      "tags": [ "Process Calculi", "Rewriting Systems" ],
      "authors": [ "Marco Peressotti" ],
      "abstract": "In modern cloud-based architectures, containers play a central role: they provide powerful isolation mechanisms such that developers can focus on the logic and dependencies of applications while system administrators can focus on deployment and management issue.  In this work, we propose a formal model for container-based systems, using the framework of Bigraphical Reactive Systems (BRSs).  We first introduce <i>local directed bigraphs</i>, a graph-based formalism which allows us to deal with localized resources.  Then, we define a signature for modelling containers and provide some examples of bigraphs modelling containers.  These graphs can be analysed and manipulated using techniques from graph theory: properties about containers can be formalized as properties of the corresponding bigraphic representations.  Moreover, it turns out that the composition of containers as performed by e.g. docker-compose, corresponds precisely to the composition of the corresponding bigraphs inside an ``environment bigraph'' which in turn is obtained directly from the YAML file used to define the composition of containers.",
      "non_group" : true,
      "type": "conference"
    }
  ]
}