{ "title" : "Preprints of Accepted Papers",
  "papers": [{
    "bibitem": "@article{CGNS, author = {Cruz-Filipe, Lu{\\'i}s and Gaspar, Gra{\\c c}a and Nunes, Isabel and Schneider-Kamp, Peter}, title = {Active Integrity Constraints for General-Purpose Knowledge Bases}, journal = {Annals of Mathematics and Artificial Intelligence}, doi = {10.1007/s10472-018-9577-y}, note = {accepted for publication}}",
    "links": [
      { "link" : "http://tinyurl.com/lcfilipe/pubs/paperA.pdf" }
    ],
    "tags": [ "Database Repair", "Knowledge Representation" ],
    "authors": [ "Luís Cruz-Filipe" ],
    "abstract": "In the database world, <i>integrity constraints</i> are essential to guarantee database integrity.  The related problem of database repair deals with finding the best way to change a database so that it satisfies its integrity constraints.  These two topics have been studied intensively since the 1980s.  The formalism of <i>active integrity constraints</i>, proposed in 2004, aims at addressing them jointly, by providing a syntax whereby a particular subclass of integrity constraints can be specified together with preferred ways to repair inconsistency.<br />In the last decade, several authors have proposed adaptations of the notion of integrity constraints to other reasoning frameworks than relational databases.  In this article, we extend this line of work in two ways.  First, we target multi-context systems, a general-purpose framework for combining heterogeneous reasoning systems, able to model most other reasoning frameworks, as we demonstrate.  Second, we extend the notions of active integrity constraints and grounded repairs to this generalized setting.  This way of including repair suggestions inside integrity constraints, subject to a validity check, enables us to define simple iterative algorithms to find all possible grounded repairs for an inconsistent multi-context system, avoiding the need to solve complex or undecidable problems.",
    "non_group" : true,
    "type": "journal"
  },
  {
    "bibitem": "@article{CCEMS, author = {Codish, Michael and Cruz-Filipe, Lu{\\'i}s and Ehlers, Thorsten and M{\\\"u}ller, Mike and Schneider-Kamp, Peter}, title = {Sorting networks: to the end and back again}, journal = {Journal of Computer and System Sciences}, doi = {10.1016/j.jcss.2016.04.004}, note = {accepted for publication}}",
    "links": [
      { "link" : "http://tinyurl.com/lcfilipe/pubs/paperB.pdf" }
    ],
    "tags": [ "Sorting Networks" ],
    "authors": [ "Luís Cruz-Filipe" ],
    "abstract": "New properties of the front and back ends of sorting networks are studied, illustrating their utility when searching for bounds on optimal networks.  Search focuses first on the &ldquo;out-sides&rdquo; of the network and then on the inner part.  Previous works focused on properties of the front end to break symmetries in the search.  The new, out-side-in, properties shed understanding on how sorting networks sort, and facilitate the computation of new bounds on optimality.  We present new, faster, parallel sorting networks for 17&ndash;20 inputs.  For 17 inputs, we show that no sorting network using less layers exists.",
    "non_group" : true,
    "type": "journal"
  },
  {
    "bibitem": "@inproceedings{AHMNP19, title={{A Graph-Based Tool to Embed the π-Calculus into a Computational DPO Framework}}, author={Jakob Lykke Andersen and Marc Hellmuth and Daniel Merkle and Nikolai N{\\o}jgaard and Marco Peressotti}, booktitle = {Proceedings of SOFSEM 2020 Student Research Forum}, series = {{CEUR} Workshop Proceedings}, publisher = {CEUR-WS.org}, year={2019}, note={accepted for publication}}",
    "links": [
      { "name" : "technical report",
        "link" : "https://arxiv.org/abs/1911.00407",
        "icon" : "arxiv" }
    ],
    "tags": [ "Process Calculi", "Graph Theory" ],
    "authors": [ "Marco Peressotti" ],
    "abstract": "Graph transformation approaches have been successfully used to analyse and design chemical and biological systems. Here we build on top of a DPO framework, in which molecules are modelled as typed attributed graphs and chemical reactions are modelled as graph transformations. Edges and vertexes can be labelled with first-order terms, which can be used to encode, e.g., steric information of molecules. While targeted to chemical settings, the computational framework is intended to be very generic and applicable to the exploration of arbitrary spaces derived via iterative application of rewrite rules, such as process calculi like Milner's π-calculus. To illustrate the generality of the framework, we introduce EpiM: a tool for computing execution spaces of π-calculus processes. EpiM encodes π-calculus processes as typed attributed graphs and then exploits the existing DPO framework to compute their dynamics in the form of graphs where nodes are π-calculus processes and edges are reduction steps. EpiM takes advantage of the graph-based representation and facilities offered by the framework, like efficient isomorphism checking to prune the space without resorting to explicit structural equivalences. EpiM is available as an online Python-based tool. ",
    "non_group" : true,
    "type": "workshop"
  }
]
}
